Repository: critzo/measure-app-legacy
Catalog: www/translations/lang/*.po
Languages: th_th

source: About
th_th: เกี่ยวกับเรา

source: About M-Lab
th_th: เกี่ยวกับ M-Lab

source: About M-Lab Measure App
th_th: เกี่ยวกับ แอปพลิเคชั่น การวัดค่า M-Lab

source: About Measure App
th_th: เกี่ยวกับ แอปพลิเคชั่น การวัดค่า

source: Add a scheduled test
th_th: เพิ่มตารางการทดสอบ

source: Annotate
th_th: อธิบาย

source: Annotations
th_th: คำอธิบายเพิ่มเติม

source: By running the tests in the M-Lab Measure App, your device will generate and send some data back-and-forth with an M-Lab server. The data collected relates to the particular communication "flows" generated between your device and an M-Lab server. This includes the IP address provided by your ISP. These data will be used and analyzed by researchers and, in order to advance research, these data will be made publicly available. The M-Lab Measure App does not collect personal information, such as your Internet traffic, your emails or Web searches.
th_th: เมื่อทำการทดสอบด้วย แอปพลิเคชั่นการวัดค่า M-Lab, อุปกรณ์จะทำการสร้าง และ ส่งข้อมูลไปมาในเซิร์ฟเวอร์ของ M-Lab ซึ่งจะทำการเก็บข้อมูลที่ส่งผ่านไปมาระหว่างอุปกรณ์ และ เซิร์ฟเวอร์ เช่น IP address ที่ระบุมาจากผู้ให้บริการอินเตอร์เนต โดยข้อมูลเหล่านี้จะนำไปใช้ในการวิเคราะห์ โดยนักวิเคราะห์ ก่อนที่แสดงผลให้ทราบโดยสาธารณะ อย่างไรก็ดี M-Lab ให้ความสำคัญกับข้อมูลส่วนตัว โดยแอปพลิเคชั่นนี้จะไม่มีการเก็บ และ แสดงข้อมูลส่วนตัว ไม่ว่าจะเป็นข้อมูลการค้นหา หรือการเข้าถึงอินเตอร์เนต หรือ e-mail ของท่าน

source: By using the M-Lab Measure app, the data about the health of the network connections you use is shared in a public dataset that researchers, ISPs, regulators and others can use to understand the Internet and how it can be improved. You can also choose to get more involved with M-Lab beyond that as well.
th_th: แอปพลิเคชั่นการวัดค่า M-Lab จะทำการวัดประสิทธิภาพของ ระบบเครือข่าย และจะทำการแสดงข้อมูลเป็นชุดข้อมูลที่ได้ทำการวิเคราะห์แล้ว เพื่อให้ผู้ให้บริการอินเตอร์เนต ผู้กำกับดูแลประสิทธิภาพสัญญาเครือข่าย และ ผู้ที่เกี่ยวข้อง สามารถใช้ข้อมูลนี้ เพื่อพัฒนาประสิทธิภาพของสัญญาณอินเตอร์เนต ซึ่งท่านสามารถมีส่วนร่วมกับ M-Lab ได้เช่นกัน

source: Cancel
th_th: ยกเลิก

source: Click and drag in the chart to zoom in
th_th: กด และ ลาก ในตาราง เพื่อดูส่วนขยาย

source: Completed
th_th: เสร็จสมบูรณ์

source: Connection Type
th_th: ประเภทการเชื่อมต่อ

source: Constantly
th_th: อย่างต่อเนื่อง

source: Current Schedule
th_th: ตารางปัจจุบัน

source: Currently the app has used <span class="badge badge-assertive"> {{ historyState.dataConsumed | formatDataConsumptionMeasurement }} </span> of data from this device.
th_th: ปัจจุบัน แอปพลิเคชั่น ใช้ข้อมูลจากอุปกรณ์ ดังนี้ <span class="badge badge-assertive"> {{ historyState.dataConsumed | formatDataConsumptionMeasurement }} </span>

source: Custom
th_th: กำหนดค่าเอง

source: Custom Schedule
th_th: กำหนดค่าตารางเอง

source: Daily
th_th: รายวัน

source: Data Usage
th_th: การใช้ข้อมูล

source: Data Used by Measure App
th_th: ข้อมูลที่ใช้โดย แอปพลิเคชั่น การวัดค่า

source: Day of Week
th_th: วัน ของสัปดาห์

source: Delete
th_th: ลบ

source: Does not collect personal information on M-Lab servers, e.g. your Internet traffic, your emails or Web searches
th_th: แอปพลิเคชั่นนี้จะไม่มีการเก็บ และ แสดงข้อมูลส่วนตัว ไม่ว่าจะเป็นข้อมูลการค้นหา หรือการเข้าถึงอินเตอร์เนต หรือ e-mail ของท่าน

source: Does share your IP Address
th_th: แสดง IP Address

source: Download
th_th: ดาวน์โหลด

source: Edit Measurement Notes
th_th: บันทึก การแก้ไขข้อมูลการวัดค่า

source: Explore Data
th_th: สำรวจข้อมูล

source: Explore M-Lab Data
th_th: สำรวจ ข้อมูล M-Lab

source: Export
th_th: ส่งออก

source: Failed to complete the measurement.
th_th: การวัดค่าไม่สมบูรณ์

source: Find Out More
th_th: ค้นหาเพิ่มเติม

source: Finding Closest Server
th_th: ค้นหา เซิร์ฟเวอร์ที่ใกล้ที่สุด

source: Finding Server
th_th: ค้นหา เซิร์ฟเวอร์

source: Friday
th_th: วันศุกร์

source: Get Involved
th_th: เข้ามามีส่วนร่วม

source: Hour
th_th: ชั่วโมง

source: Hourly
th_th: รายชั่วโมง

source: Information
th_th: ข้อมูล

source: Internet Tests
th_th: ทดสอบ อินเตอร์เนต

source: Language
th_th: ภาษา

source: Latency
th_th: ศักยภาพ

source: Learn more about NDT
th_th: เรียนรู้เพิ่มเติมเกี่ยวกับ NDT

source: Location
th_th: สถานที่

source: M-Lab Measure
th_th: การวัดค่า M-Lab

source: M-Lab Site
th_th: M-Lab ไซต์

source: M-Lab data is openly available to researchers, but we also have developed tools to let anyone explore our data. If you're interested in seeing the measurements of Internet speed and health are in your area, browse our data on our <a href="http://www.measurementlab.net/observatory" target="_system">Internet Observatory</a>.
th_th: ข้อมูล M-Lab เป็นข้อมูลที่เปิดเผย และสร้างขึ้นสำหรับนักวิจัย โดยเรามีเครื่องมือให้ทุกคนสามารถค้นหาข้อมูลของเราได้ หากคุณสนใจการวัดความเร็ว และ ประสิทธิภาพของอินเตอร์เนต ท่านสามารถหาข้อมูลได้ที่ <a href="http://www.measurementlab.net/observatory" target="_system">Internet Observatory</a>.

source: M-Lab is a platform for the use of independent tools created by researchers to gather information relevant to broadband services. The goal of the project is to analyze information regarding broadband networks and report this information to the public.
th_th: M-lab เป็นแพลตฟอร์ เพื่อใช้สำหรับเครื่องมืออิสระ ที่สร้างขึ้นโดยนักวิเคราะห์ เพื่อเก็บข้อมูลที่เกี่ยวข้องกับการให้บริการอินเตอร์เนต โครงการนี้มีเป้าหมายเพื่อทำการวิเคราะห์ข้อมูลที่เกี่ยวข้องกับระบบเครือข่ายอินเตอร์เนต และ ทำการรายงานข้อมูลสู่สาธารณะ

source: M-Lab offers a number of measurement tools, allowing consumers to test for everything from network speed and latency to blocking and throttling. All tools perform only active measurements against the M-Lab platform. This means that M-Lab tests measure how your network connection responds to a synthetic stream of data generated by the individual tool solely for the purpose of measurement. The tools do not collect information about your other Internet traffic, such as emails, web searches, content you view, or any personally identifiable information. All data collected is made publicly available, including the IP address provided by your ISP at the edge of your network. All tools are open source and created by researchers. For more information, see M-Lab’s privacy policy.
th_th: M-Lab มีเครื่องมือหลากหลายในการวัดผล โดยเปิดโอกาสให้ผู้บริโภค สามารถทำการทดสอบประสิทธิภาพของระบบเครือข่าย รวมถึงการวัด ความล่าช้า อันเกิดจากการสกัดกั้นสัญญาณอินเตอร์เนต จากผู้ให้บริการอินเตอร์เนต โดยเครื่องมือ M-Lab จะทำการวัดค่าโดยดูจากการตอบสนองของระบบเครือข่าย ที่มีต่อสัญญาณที่สร้างขึ้นโดยระบบข้อมูล โดยเครื่องมือแต่ละตัวจะมีวัตถุประสงค์ในการวัดค่าต่างกัน โดยเครื่องมือนี้จะไม่มีการเก็บ และ แสดงข้อมูลส่วนตัว ไม่ว่าจะเป็นข้อมูลการค้นหา หรือการเข้าถึงอินเตอร์เนต หรือ e-mail ของท่าน โดยข้อมูลที่เกี่ยวข้องเท่านั้นที่จะทำการเก็บ วิเคราะห์ และ เปิดเผยต่อสาธารณะ รวมถึง IP Address จากผู้ให้บริการอินเตอร์เนต เครื่องมือทั้งหมดเป็น Opensource ที่สร้างขึ้นโดย ท่านสามารถหาข้อมูลเพิ่มเติมได้ที่ นโยบายความเป็นส่วนตัวของ M-Lab

source: M-Lab's complete <a href="http://www.measurementlab.net/privacy" target="_system">Acceptable Use and Privacy Policies</a> are available on our website.
th_th: M-Lab เสร็จสมบูรณ์ <a href="http://www.measurementlab.net/privacy" target="_system">ยอมรับข้อตกลง และ นโยบายคามเป็นส่วนตัว </a> อยู่บนเวบไซต์

source: Management
th_th: การบริหารจัดการ

source: Measure
th_th: การวัดค่า

source: Measurement Data
th_th: ข้อมูลการวัดค่า

source: Measurement History
th_th: ประวัติการวัดค่า

source: Measurement Lab (M-Lab) is a consortium of research, industry, and public interest partners dedicated to providing an open, verifiable measurement platform for global network performance. The M-Lab platform is an open, distributed network of servers on which researchers can deploy open source Internet measurement tools. M-Lab’s goal is to advance network research and empower the public with useful information about their broadband and mobile connections.
th_th: ห้องปฏิบัติการการวัดค่า หรือ Measurement Lab (M-Lab) เป็นความร่วมมือกันของ ทีมวิจัย อุตสาหกรรม และ พันธมิตร ที่มีความสนใจสละเวลาร่วมกันในการสร้างเครื่องมือ หรือ แพลตฟอร์ม เพื่อแสดงข้อมูลที่เปิดเผย เชื่อถือได้ เพื่อแสดงผลประสิทธิภาพเครือข่ายอินเตอร์เนตของทั่วโลก M-Lab เป็นเครื่องมือที่เปิดเผย ที่ทำให้นักวิจัยสามารถต่อยอดเครื่องมือการวัดด้วย Open source โดยมีเป้าหมายเพื่อแสดงข้อมูลเกี่ยวกับ การเชื่อมต่อเครื่อข่ายอินเตอร์เนต และ มือถือ อันเป็นประโยชน์เพื่อการพัฒนาประสิทธิภาพอินเตอร์เนตต่อไป

source: Measurement Notes
th_th: บันทึกการวัดค่า

source: Midnight
th_th: เที่ยงคืน

source: Monday
th_th: วันจันทร์

source: More
th_th: เพิ่มเติม

source: More Information
th_th: ข้อมูลเพิ่มเติม

source: Next Test
th_th: การทดสอบถัดไป

source: No tests scheduled.
th_th: ไม่มีตารางการทดสอบ

source: Only Test on WiFi
th_th: เฉพาะสำหรับการทดสอบบน WiFi

source: Performance
th_th: ประสิทธิภาพ

source: Pinch the chart to zoom in
th_th: ลากขยายเพื่อดูส่วนขยาย

source: Please be aware that the data the Measure App uses does count toward any monthly service or data plan you subscribe to.
th_th: แอปพลิเคชั่นการวัดค่านี้ มีการส่งข้อมูลเพื่อทดสอบ ซึ่งอาจมีค่าใช้จ่ายการใช้บริการจากผู้ให้บริการอินเตอร์เนต

source: Privacy Policy
th_th: นโยบายความเป็นส่วนตัว

source: Reset Measurement History
th_th: ล้างประวัติการวัดค่า

source: Retransmissions
th_th: การส่งข้อมูลอีกครั้ง

source: Running Test (Download)
th_th: กำลังทดสอบ (ดาวน์โหลด)

source: Running Test (Upload)
th_th: กำลังทำการทดสอบ (อัพโหลด)

source: Saturday
th_th: วันเสาร์

source: Save
th_th: บันทึก

source: Schedule
th_th: ตาราง

source: Schedule Test
th_th: ตารางการทดสอบ

source: Schedule a Test
th_th: ตั้งตารางการทดสอบ

source: Server Selection
th_th: เลือกเซิร์ฟเวอร์

source: Service Provider
th_th: ผู้ให้บริการ

source: Settings
th_th: การตั้งค่า

source: Start Test
th_th: เริ่มต้นการทดสอบ

source: Starting
th_th: กำลังเริ่มต้น

source: Statistic
th_th: สถิติ

source: Sunday
th_th: วันอาทิตย์

source: The M-Lab Measure App implements one test, the Network Diagnostic Tool (NDT). NDT is developed and maintained by Internet 2 and provides a sophisticated speed and diagnostic test suitable for both the novice and the network researcher. For more information on NDT and other M-Lab tests, please visit our the NDT page on M-Lab's site.
th_th: แอปพลิเคชั่นการวัดค่า M-Lab ทำการทดสอบวิเคราะห์ระบบเครือข่าย เรียกว่า the Network Diagnostic Tool (NDT) ซึ่งสร้าง และ ดูแลโดย อินเตอร์เนต 2 และ ให้ข้อมูลความเร็วอินเตอร์เนต และ การวิเคราะห์ ข้อมูลที่ซับซ้อนอย่างเหมาะสม โดยนักวิเคราะห์ระบบเครือข่าย ท่านสามารถหาข้อมูลเพิ่มเติมเกี่ยวกับ NDT และ การทดสอบอื่นๆ ของ M-Lab ได้ที่ หน้าเพจของ NDT บนเวบไซต์ M-Lab

source: The M-Lab Measure App uploads and downloads data for the purposes of measuring your connections to the Internet.
th_th: แอปพลิเคชั่นการวัดค่า M-Lab จะอัพโหลด และ ดาวน์โหลดข้อมูล เพื่อทำการวัดค่า การเชื่อมต่อสัญญาณเครือข่ายอินเตอร์เนตของคุณ

source: There are a many ways to get involved with M-Lab, whether you're an individual or represent an organization. Find out other ways to <a href="http://measurementlab.net/contribute" target="_system">contribute</a> on our website.
th_th: มีหลายวิธีที่ท่านสามารถเข้าร่วมเป็นส่วนหนึ่งกับ M-Lab ไม่ว่าจะเป็นในนามบุคคล หรือ ตัวแทนจากองค์กร ท่านสามารถหาข้อมูลเพิ่มเติมในการเข้าร่วมได้ที่ <a href="http://measurementlab.net/contribute" target="_system">contribute</a> on our website.

source: This application:
th_th: แอปพลิเคชั่นนี้

source: This could be due to a change in connectivity during the test, blocking of the test by the network or other factors.
th_th: นี่อาจเป็นผลมาจากการเปลี่ยนแปลงการเชื่อมต่อสัญญาณ ระหว่างการทดสอบ ทำให้เกิดการปิดกันการทดสอบโดย ระบบเครือข่าย หรือ อาจเกิดจากปัจจัยอื่น ๆ

source: Thursday
th_th: วันพฤหัสบดี

source: Time
th_th: เวลา

source: Translate the M-Lab Measure App
th_th: แปล แอปพลิเคชั่นการวัดค่า M-Lab

source: Trusted Tester
th_th: ผู้ทดสอบที่เชื่อถือได้

source: Tuesday
th_th: วันอังคาร

source: Upload
th_th: อัพโหลด ข้อมูล

source: Wednesday
th_th: วันพุธ

source: Weekly
th_th: ทุกสัปดาห์

source: Would you like to help translate the M-Lab Measure App for other languages? Get involved as a translator or translation reviewer on <a href="https://www.transifex.com/otf/mlab-app/" target="_system">Transifex</a>, or <a href="http://www.measurementlab.net/contact" target="_system">contact us for more information!</a>!
th_th: สนใจช่วยแปล แอปพลิเคชั่นการวัดค่า M-Lab เป็นภาษาอื่นๆ หรือไม่? คุณสามารถมีส่วนร่วมในฐานะผู่ช่วยแปลภาษา หรือ ช่วยตรวจสอบการแปลภาษาได้ที่ <a href="https://www.transifex.com/otf/mlab-app/" target="_system">Transifex</a>, or <a href="http://www.measurementlab.net/contact" target="_system"> ติดต่อเรา เพื่อหาข้อมูลเพิ่มเติม !</a>!

source: Your Location
th_th: สถานที่ของคุณ

source: {{timeofday}} hour, every {{dayofweek}}
th_th: {{timeofday}} ชั่วโมง, ทุกๆ {{dayofweek}}
